{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Honours Bachelor of Sciences",
      "department": "Computer Science specializing in Software Engineering",
      "duration": "2016-2021",
      "school_name": "University of Toronto Scarborough"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AnurudranChandrasekaram",
  "highlighted_projects": [
    {
      "description": "Suspendisse a tincidunt odio. Suspendisse posuere luctus aliquet. Quisque magna tellus, tempor vitae arcu sed, volutpat scelerisque lacus. Aliquam varius pulvinar dapibus. Ut a tincidunt sem. Aenean sollicitudin fringilla erat ut imperdiet. Phasellus fermentum, enim vitae laoreet elementum, eros nisl hendrerit lorem.",
      "git_url": "https://github.com/jarviscanada/jarvis_profile_builder",
      "name": "Web app for resturant"
    },
    {
      "description": "Suspendisse a tincidunt odio. Suspendisse posuere luctus aliquet. Quisque magna tellus, tempor vitae arcu sed, volutpat scelerisque lacus. Aliquam varius pulvinar dapibus. Ut a tincidunt sem. Aenean sollicitudin fringilla erat ut imperdiet. Phasellus fermentum, enim vitae laoreet elementum, eros nisl hendrerit lorem.",
      "git_url": null,
      "name": "Machine Learning"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Created a product that is able to get the host hardware information as well as all the host's usage information every minute that are currently on the server. This project was built using docker, bash scripts, and sql. Used postgresql as the rdbms to store the host's harware and usage information so we can write sql queries that can answer various buisness questions.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: This app is a connection between Java and RDBMS. It uses the CRUD and DAO design patterns.",
        "Grep App: Created an app that mimics the linux grep command. It takes a directory or file and traverses each file and each line in the file to find a pattern that matches the regex expression given."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Anurudran Chandrasekaram",
  "others": [
    {
      "bullets": [
        "Basketball and Ultimate Frisbee player",
        "Competitive gaming"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Learning various programming languages and tools to by completing various projects such as the Cluster Monitor project or Java grep. Working in a agile/scrum approach to complete those projects",
      "duration": "2022-present",
      "title": "Software Developer"
    },
    {
      "company": "Ontario Public Service",
      "description": "Developed Test scripts using Java and Selenium to automate the webpages onto different web browsers to test the functionality of the website and used Git for deployment of our code. Researched and Developed a new way in doing load testing to ensure the websites can handle traffic overload and not crash.",
      "duration": "September 2020 - April 2021",
      "title": "Jr Software Engineer Co-op"
    },
    {
      "company": "Public Services and Procurement Canada",
      "description": "Worked in a waterfall style project management using Jira with a group of 6 co-workers to deliver the annual financial activities made by the country viewed by millions. Communicated effectively with clients by producing clarity and depth responses to significantly reduce turnaround back and forth communication",
      "duration": "September 2019 - December 2019",
      "title": "Web Developer Co-op"
    },
    {
      "company": "CIBC Digital",
      "description": "Used Adobe Experience Manager and eBanking platform to test changes made on the CIBC and Simplii website that are viewed by millions. Coordinated with team members through email and on Jira to efficiently and effectively test, send changes, publish to production and retest in production in a span of 1 hour. Effectively tested new pages and variety of change requests varying from 5-50 changes to reduce reopening issues on a daily basis",
      "duration": "January 2019 - April 2019",
      "title": "Senior QA Specialist Co-op"
    }
  ],
  "skills": {
    "competent": [
      "Java",
      "Design Patterns",
      "Javascript",
      "Network Security",
      "HTML/CSS"
    ],
    "familiar": [
      "C",
      "Haskell",
      "SVN",
      "Dynamic Programming",
      "Assembly language"
    ],
    "proficient": [
      "Python",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "My name is Anurudran Chandrasekaram and I am a University of Toronto Scarborough graduate. I completed my bachelors degree is computer science specializing in the software engineering field."
}
