{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Honours Bachelor of Sciences",
      "department": "Computer Science specializing in Software Engineering",
      "duration": "2016-2021",
      "school_name": "University of Toronto Scarborough"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AnurudranChandrasekaram",
  "highlighted_projects": [
    {
      "description": "Created an AirBnb Database using RDBMS by creating tables for a user to create an account as a host or renter and be able to host or rent a listing for certain days.",
      "name": "AirBnb Database"
    },
    {
      "description": "Worked on a Matplotlib issue by creating a feature that is able to toggle the visbility of sub plots on a graph through the legend handler. This project was worked with a group of 5 people using a waterfall project methodology. The tools used where gitbuh, python and pytest to test the feature.",
      "name": "Matplotlib"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Created a product that is able to get the host hardware information as well as all the host's usage information every minute that are currently on the server. This project was built using docker, bash scripts, and sql. Used postgresql as the rdbms to store the host's harware and usage information so we can write sql queries that can answer various buisness questions.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App (In Progress): Creating an app that is able to create, update and delete a tweet using the twitter API. This app follows the DAO design pattern and uses Mockito and JUnit to create test cases for testing the app.",
        "JDBC App: This app is a connection between Java and RDBMS. It uses the CRUD and DAO design patterns.",
        "Grep App: Created an app that mimics the linux grep command. It takes a directory or file and traverses each file and each line in the file to find a pattern that matches the regex expression given."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Anurudran Chandrasekaram",
  "others": [
    {
      "bullets": [
        "Basketball and Ultimate Frisbee player",
        "Competitive gaming",
        "Working out"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Learning various programming languages such as Python, SQL, and Java and tools such as GitHub and Notion by completing various projects such as the Cluster Monitor project or Java grep app. Also working in an agile/scrum environment to complete the tasks and projects efficently. ",
      "duration": "2022-present",
      "title": "Software Developer"
    },
    {
      "company": "Ontario Public Service",
      "description": "Developed Test scripts using Java and Selenium to automate the webpages onto different web browsers to test the functionality of the website and used Git for deployment of our code. Researched and Developed a new way in doing load testing to ensure the websites can handle traffic overload and not crash.",
      "duration": "September 2020 - April 2021",
      "title": "Jr Software Engineer Co-op"
    },
    {
      "company": "Public Services and Procurement Canada",
      "description": "Worked in a waterfall style project management using Jira with a group of 6 co-workers to deliver the annual financial activities made by the country viewed by millions. Communicated effectively with clients by producing clarity and depth responses to significantly reduce turnaround back and forth communication",
      "duration": "September 2019 - December 2019",
      "title": "Web Developer Co-op"
    },
    {
      "company": "CIBC Digital",
      "description": "Used Adobe Experience Manager and eBanking platform to test changes made on the CIBC and Simplii website that are viewed by millions. Coordinated with team members through email and on Jira to efficiently and effectively test, send changes, publish to production and retest in production in a span of 1 hour. Effectively tested new pages and variety of change requests varying from 5-50 changes to reduce reopening issues on a daily basis",
      "duration": "January 2019 - April 2019",
      "title": "Senior QA Specialist Co-op"
    }
  ],
  "skills": {
    "competent": [
      "Agile/Scrum",
      "Design Patterns",
      "Javascript",
      "Network Security",
      "HTML/CSS"
    ],
    "familiar": [
      "C",
      "Haskell",
      "SVN",
      "Waterfall",
      "Assembly language"
    ],
    "proficient": [
      "Python",
      "RDBMS/SQL",
      "Java",
      "Linux/Bash",
      "Git"
    ]
  },
  "summary": "My name is Anurudran Chandrasekaram and I am a University of Toronto Scarborough graduate. I completed my bachelors degree is computer science specializing in the software engineering field. I have worked in many different team enivornments such as Waterfall or Agile through the Co-op placements I have done in the past. I enjoy problem solving and learned to work well under pressure based on working on projects that are time sensitive and needed to be finished by a final deadline."
}
